[
    {
        "name": "Cappuccino",
        "category": "Coffee",
        "description": "A classic Italian espresso-based drink made with rich espresso, steamed milk, and a thick layer of milk foam. Perfect for a morning boost or an afternoon treat.",
        "instructions": [
            "Brew a shot of espresso and pour it into a cup.",
            "Steam milk until it reaches a frothy, creamy consistency.",
            "Pour the steamed milk over the espresso, holding back the foam.",
            "Spoon the milk foam on top and serve hot."
        ],
        "favorite": "*"
    },
    {
        "name": "Mojito",
        "category": "Cocktail",
        "description": "A refreshing Cuban cocktail made with fresh mint, lime, white rum, and soda water. A perfect summer drink.",
        "instructions": [
            "Muddle mint leaves, lime juice, and sugar in a glass.",
            "Fill the glass with ice cubes.",
            "Pour in the white rum.",
            "Top with soda water and stir gently.",
            "Garnish with a sprig of mint and serve chilled."
        ],
        "favorite": ""
    },
    {
        "name": "Matcha Latte",
        "category": "Tea",
        "description": "A creamy, earthy green tea latte made with matcha powder and frothed milk. A great alternative to coffee with a smooth, energizing effect.",
        "instructions": [
            "Sift 1 teaspoon of matcha powder into a bowl.",
            "Add a small amount of hot water (not boiling) and whisk until smooth.",
            "Heat and froth milk until warm and foamy.",
            "Pour the frothed milk over the matcha mixture and stir gently.",
            "Optionally, sweeten with honey or sugar to taste."
        ],
        "favorite": "*"
    },
    {
        "name": "Strawberry Smoothie",
        "category": "Smoothie",
        "description": "A refreshing and healthy smoothie packed with fresh strawberries, banana, and yogurt.",
        "instructions": [
            "Add 1 cup of fresh or frozen strawberries, 1 banana, and 1/2 cup of yogurt to a blender.",
            "Pour in 1/2 cup of milk or juice.",
            "Blend until smooth and creamy.",
            "Pour into a glass and serve immediately."
        ],
        "favorite": "*"
    },
    {
        "name": "Old Fashioned",
        "category": "Cocktail",
        "description": "A timeless whiskey cocktail featuring a balance of sweetness, bitters, and citrus.",
        "instructions": [
            "Place a sugar cube in a glass and soak it with a few dashes of bitters.",
            "Muddle the sugar until dissolved.",
            "Add a large ice cube and pour in 2 oz of bourbon or rye whiskey.",
            "Stir gently to combine.",
            "Garnish with an orange twist and a cherry."
        ],
        "favorite": ""
    },
    {
        "name": "Iced Americano",
        "category": "Coffee",
        "description": "A simple and bold coffee drink made by diluting espresso with cold water and serving over ice.",
        "instructions": [
            "Brew a double shot of espresso.",
            "Fill a glass with ice cubes.",
            "Pour the espresso over the ice.",
            "Add cold water to taste and stir."
        ],
        "favorite": ""
    },
    {
        "name": "Chai Tea Latte",
        "category": "Tea",
        "description": "A warm, spiced tea latte made with black tea, milk, and aromatic spices.",
        "instructions": [
            "Steep a black tea bag in hot water for 5 minutes.",
            "In a saucepan, heat milk with cinnamon, cardamom, ginger, and cloves.",
            "Strain the milk mixture and mix it with the brewed tea.",
            "Sweeten with honey or sugar if desired.",
            "Serve warm and enjoy."
        ],
        "favorite": ""
    },
    {
        "name": "Pina Colada",
        "category": "Cocktail",
        "description": "A tropical, creamy cocktail made with coconut milk, pineapple juice, and rum.",
        "instructions": [
            "Add 2 oz of white rum, 3 oz of pineapple juice, and 2 oz of coconut milk to a blender.",
            "Blend with ice until smooth.",
            "Pour into a chilled glass.",
            "Garnish with a pineapple wedge and a cherry."
        ],
        "favorite": "*"
    },
    {
        "name": "Hot Chocolate",
        "category": "Hot Beverage",
        "description": "A rich and creamy chocolate drink made with milk, cocoa, and sugar.",
        "instructions": [
            "Heat 1 cup of milk in a saucepan over medium heat.",
            "Whisk in 2 tablespoons of cocoa powder and 1 tablespoon of sugar.",
            "Stir until fully dissolved and heated through.",
            "Pour into a mug and top with whipped cream if desired."
        ],
        "favorite": ""
    },
    {
        "name": "Lemonade",
        "category": "Non-Alcoholic",
        "description": "A refreshing citrus drink made with freshly squeezed lemon juice, sugar, and water.",
        "instructions": [
            "Juice 4 fresh lemons.",
            "In a pitcher, mix lemon juice with 4 cups of cold water.",
            "Add 1/2 cup of sugar and stir until dissolved.",
            "Serve over ice and enjoy."
        ],
        "favorite": "*"
    }
]